# OriginatingElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening..::..OriginatingElementId Property
EnergyAnalysisOpening Class See Also
---
The element id for the originating Revit element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public LinkElementId OriginatingElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OriginatingElementId As LinkElementId
	Get
```

Visual C++
---
```text
public:
property LinkElementId^ OriginatingElementId {
	LinkElementId^ get ();
}
```

# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace